"AboutBoxString" = "Created with Compressor";
"HelpMsg" = "For information about using droplets, see the Compressor User Manual, available in the Compressor Help menu.";
"Untitled" = "Untitled";

"DestinationLocation" = "Destination Location";
"Choose" = "Choose"; /* default button title in the choose destinaton dialog */

"DropFilesHere" = "Drop files here"; /* help text displayed in source files view when no files are present */

/* cluster menu */
"ThisComputer" = "This Computer";
"SubmitPriority" = "Priority";
"SubmitPriorityLow" = "Low";
"SubmitPriorityMedium" = "Medium";
"SubmitPriorityHigh" = "High";
"NoClusters" = "None";
"Other" = "Other…";

/* Launch droplet alert */
"DropletLaunchFailed" = "You must update this Droplet to locate Compressor.";
"DropletLaunchErrorMsg" = "To update all Droplets on this computer click the Advanced tab in the Compressor Settings and then click the “Update Droplets” button.";
"OKButton" = "OK";

/* Job Action related */
"NoJobAction" = "None";
"VerifyingLogin" = "Verifying…";

/* CQBatchSubmitter */

/* SMB Sharing */
"SMBSharingPreferencesNotSetUpError" = "Do you want to continue without distributed processing?";

"SMBSharingLearnMoreInfo" = "To use distributed processing with this job, you must turn on SMB file sharing in System Seettings. For more information about distributed processing and SMB file sharing, click Learn More.\n\nTo process this job using this computer only, click Continue.\n";

"ContinueButton" = "Continue";
"LearnMoreButton" = "Learn More…";

"ClusterNodesNotAvailableError" = "Unavailable computers in Shared Computing Group.";
"ClusterNodesNotAvailableMoreInfo" = "Compressor cannot distribute processing to all the computers in this group because of the following:\n\n";

"ClusterNodesNotAvailableItemFormat" = "•	%@\n";
"ComputerUnavailableOrOffline" = "Computer unavailable or offline";
"UntrustedServerCertificate" = "Untrusted server certificate";
"MissingPassword" = "Missing password";

"ClusterNodesNotAvailableRecoverySuggestion" = "Open the Shared Computers preferences to resolve these issues\n";

"IgnoreButton" = "Ignore";
"OpenPreferencesButton" = "Open Settings";

/* Cluster node macOS compatibility check during batch submit */
"ClusterNodesNotMacOSCompatibleError" = "Do you want to continue with distributed processing?";
"ClusterNodesNotMacOSCompatibleMoreInfo" = "Some of the cluster nodes for the computer group “%@” are running an older version of macOS. Rendering quality may suffer.\n\nTo process this job using available nodes, click Continue.\n";

"UntitledClusterName" = "Untitled";

/* Submit related errors */
"SubmitNoClusterErrorMsg" = "Unable to submit to queue.";
"SubmitNoClusterErrorInfo" = "Please restart your computer or verify your Compressor installation is correct.";
"CancelButton" = "Cancel";
"RepairCompressorButton" = "Repair Compressor";

"BatchSubmissionFailedErrorFormat" = "Batch submission failed: %@";

"QueueFullAlertMessageText" = "Too many processing batches.";
"QueueFullAlertInfoText" = "Transcoding will become available when the number of active batches is less than the queue limit set in application preferences.";
